
/*--查询表中数据--*/
select * from recipe;

/*--菜谱表--*/

insert into Recipe values(1,'宫保鸡丁','../img/recipe/r1.jpg','以前不会做宫爆鸡丁，于是便在网上找了好多视频啊什么的，看做法，可是炒来炒去都不是那个味道，于是就一次次失败一次次尝试，终于成功了！味道咸鲜，有点微辣，大家可以做做看喔！',8,1,2,1,1,1,8);
insert into Recipe values(2,'糖醋鲤鱼','../img/recipe/r2.jpg','这道私房菜——糖醋鲤鱼，与糖醋排骨、糖醋丸子、糖醋鸡蛋相比而言，想必更受美食家们的喜爱。其特点色泽黄亮，花瓣清晰，皮脆肉嫩，酸甜鲜香。',6,1,1,2,1,2,9);
insert into Recipe values(3,'醋溜土豆丝','../img/recipe/r3.jpg','说起这个醋溜土豆丝，也算是我曾经初入厨房的启蒙菜了。因为喜爱土豆绵软的口感，但又不喜欢那种脆脆的感觉，我愣是把这道爽口的醋溜土豆丝做成了我喜爱的口感，不过萝卜白菜各有所爱，做饭不就是按照自己的口味自由发挥嘛！',6,1,1,2,1,2,9);
insert into Recipe values(4,'四喜丸子','../img/recipe/r4.jpg','四喜丸子是鲁菜经典的代表菜之一，因通常每四个为一份，兼取丸子团圆喜庆之意，故名“四喜丸子”。它既是一道家常菜，也是山东一带年节喜庆很常见的一道宴客菜。',6,1,1,2,1,2,9);
insert into Recipe values(5,'素烧鹅','../img/recipe/r5.jpg','传统的素烧鹅都是油炸的，过于油腻，我改良了一下，先蒸后烤，减少了油量，健康又美味。',6,1,1,2,1,2,9);
insert into Recipe values(6,'湖南特色口味虾','../img/recipe/r6.jpg','湖南特色口味虾与口味嗦螺，口味蟹都是湖南传统美食，夏日宵夜配上冰镇啤酒整个夏日增添了多汁色彩。',6,1,1,2,1,2,9);


--口味
insert into Recipe values(7,'青椒炒鸡蛋','../img/recipe/taste1_1.jpg','适合上班族，几分钟就搞定',1,1,1,2,1,2,9);
insert into Recipe values(8,'凉拌双耳','../img/recipe/taste1_2.jpg','信任之美八朵木耳，泡发简单，木耳厚实，口感脆嫩，真真儿的好木耳，是我吃过最好的木耳。木耳中铁的含量极为丰富，经常吃木耳能养血驻颜，令人肌肤红润，容光焕发，并可防治缺铁性贫血，木耳中的胶质可把残留在人体消化系统内的灰尘、杂质吸附集中起来排出体外，从而起到清胃涤肠的作用，常吃可真的是一身轻松。这款凉拌双耳很能够品味出木耳的脆嫩的口感，添加的辣根绝对的别有一番风味。',1,1,1,2,1,2,9);

insert into Recipe values(15,'麻辣鸡块','../img/recipe/taste2_1.jpg','用烤箱做的麻辣鸡块没有油炸的口感酥，但胜在健康！',2,1,1,2,1,2,9);


--工艺
insert into Recipe values(9,'香肠豆瓣菜饭','../img/recipe/craft1_1.jpg','新鲜蚕豆再不吃马上就要下市了，现在的豆瓣厚实又糯，加点香肠做饭那是最好不过的，香肠的浓香，豆瓣的鲜香，加上点卷心菜清香，混合成菜饭的美味，不需要任何的配菜，随随便便一碗饭就下肚了。',1,1,1,2,1,2,9);
insert into Recipe values(10,'浓酱茭白','../img/recipe/craft1_2.jpg','茭白，又名高瓜、菰笋、菰手、茭笋，高笋。你们那边称它为什么名呢？烹饪茭白的方法如果它的名字一样得。在我们当地有白灼，干蒸，清炒，都是极好的呢。但是后来我外嫁湖南，我一直就在红烧，干煸，爆炒茭白间游荡。今天还是以烧的形式来烹饪茭白吧，但是这里要讲的是用豆瓣来调味，马上让这时令蔬菜瞬间变成荤菜的感觉呢。',1,1,1,2,1,2,9);


--耗时
insert into Recipe values(11,'酥炸粽子','../img/recipe/costTime1_1.jpg','端午节过完，家里难免有剩余粽子。不管咸味粽子还是甜味粽子，过完端午节，粽子就应该有另外一个舞台，而不能再用粽叶包裹。华丽的转身——炸粽子，外酥里软，可以当甜点，下午茶吃。小块小口吃，优雅，健康,新口味。酥炸粽子。炸粽子利用二次炸方式，不仅不吸油，还外酥里软糯，好吃，更健康哦。',1,1,1,2,1,2,9);

--难度
insert into Recipe values(12,'脆啵啵的猫耳朵','../img/recipe/difficulty1_1.jpg','Diy制作“猫耳朵”喜迎端午佳节。一片一片的，咬起来嘎吱嘎吱的，香甜酥脆 、特别好吃',1,1,1,1,1,2,9);

--分类
insert into Recipe values(13,'包菜炒粉丝','../img/recipe/category1_1.jpg','包菜炒粉丝',1,1,1,1,1,1,9);

--菜系
insert into Recipe values(14,'宫保豆腐','../img/recipe/cuisine1_1.jpg','豆腐的做法有很多种，这道宫保豆腐是从宫保鸡丁演变而来的，只是将鸡丁换成了豆腐。另外，我为口感更加清爽，特意将花生换成黄瓜。这道菜色泽红润，味道鲜辣甜香，是一道非常下饭又易做的家常菜肴。豆腐为补益清热养生食品，常食可补中益气、清热润燥、生津止渴、清洁肠胃。更适于热性体质、口臭口渴、肠胃不清、热病后调养者食用。',1,1,1,1,1,2,1);








--提交
commit;
